---
type: TopographyLinkType
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 2
tags: [revit-api, class]
---

# TopographyLinkType

`Autodesk.Revit.DB.Architecture.TopographyLinkType` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Reload | 2019.2 | `public LinkLoadResult Reload ()` |
| Property | Parameter | — | `` |